sisext-sapi-services/src/main/resources/soap/schemas/templates/soap-post-transunion.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inf="http://infocomercial.cifin.asobancaria.com"><soapenv:Header/><soapenv:Body><inf:consultaXml soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><parametros xsi:type="dto:ParametrosConsultaDTO" xmlns:dto="http://dto.infocomercial.cifin.asobancaria.com"><codigoInformacion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">#[%dw 2.0 output text/plain --- vars.inputBody.sCodInformacion]</codigoInformacion><fechaExpedicion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">#[%dw 2.0 output text/plain --- vars.inputBody.sFecDocumento]</fechaExpedicion><motivoConsulta xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">#[%dw 2.0 output text/plain --- vars.inputBody.sMotConsulta]</motivoConsulta><numeroIdentificacion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">#[%dw 2.0 output text/plain --- vars.inputBody.sNumDocumento]</numeroIdentificacion><parametrosConsulta/><primerApellido xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">#[%dw 2.0 output text/plain --- vars.inputBody.sPrimerApellido]</primerApellido><tipoIdentificacion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">#[%dw 2.0 output text/plain --- vars.responseHomologation.homologation]</tipoIdentificacion></parametros></inf:consultaXml></soapenv:Body></soapenv:Envelope>